In [91]:
import pandas as pd
import numpy as np
import re
ID=[1,2,3,4,5] 
nombres = ['Juan','Ana','Diego','María','Pedro']
sexo=['M','F','M','F','M']
a=[3,4,4.7,2.9,2.7]
b=[4.5,3.7,4.1,3.1,3]
df=pandas.DataFrame({'ID':ID,'nombres':nombres,'sexo':sexo,'calif_sem1':a,'calif_sem2':b})
df

   ID nombres sexo  calif_sem1  calif_sem2
0   1    Juan    M         3.0         4.5
1   2     Ana    F         4.0         3.7
2   3   Diego    M         4.7         4.1
3   4   María    F         2.9         3.1
4   5   Pedro    M         2.7         3.0

In [32]:
# Python
df_long = df.melt(var_name='semestre', value_name = 'calif',
                               id_vars=['ID','nombres'],
                               value_vars=['calif_sem1', 'calif_sem2'])

In [33]:
df_long['semestre']=df_long['semestre'].apply(lambda x: re.sub('calif_sem','',x))
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.apply.html
df_long['semestre']=pd.to_numeric(df_long['semestre'])
df_long

   ID nombres  semestre  calif
0   1    Juan         1    3.0
1   2     Ana         1    4.0
2   3   Diego         1    4.7
3   4   María         1    2.9
4   5   Pedro         1    2.7
5   1    Juan         2    4.5
6   2     Ana         2    3.7
7   3   Diego         2    4.1
8   4   María         2    3.1
9   5   Pedro         2    3.0

# Long to Wide format

In [51]:
data_long = pd.DataFrame({'ID':[1,2,3,4,5,1,2,3,4,5],
 'nombre':['Juan','Ana','Diego','María','Pedro','Juan','Ana','Diego','María','Pedro'],
 'semestre':[1,1,1,1,1,2,2,2,2,2], 'calif': [3.0,4.0,4.7,2.9,2.7,4.5,3.7,4.1,3.1,3.0]})
data_long

   ID nombre  semestre  calif
0   1   Juan         1    3.0
1   2    Ana         1    4.0
2   3  Diego         1    4.7
3   4  María         1    2.9
4   5  Pedro         1    2.7
5   1   Juan         2    4.5
6   2    Ana         2    3.7
7   3  Diego         2    4.1
8   4  María         2    3.1
9   5  Pedro         2    3.0

In [50]:
data_wide = data_long.pivot(index = "ID", columns = "semestre", values = "calif").reset_index()
data_wide

semestre  ID    1    2
0          1  3.0  4.5
1          2  4.0  3.7
2          3  4.7  4.1
3          4  2.9  3.1
4          5  2.7  3.0

In [56]:
data_wide = data_long.pivot_table(index = ["ID",'nombre'], columns = "semestre", values = "calif",
                                 aggfunc=np.sum).reset_index()
data_wide

semestre  ID nombre    1    2
0          1   Juan  3.0  4.5
1          2    Ana  4.0  3.7
2          3  Diego  4.7  4.1
3          4  María  2.9  3.1
4          5  Pedro  2.7  3.0

# Manejo de multindex

In [93]:
arr_dptompio = [np.array(['Cundinamarca', 'Cundinamarca', 'Antioquia', 'Antioquia', 'Atlántico', 'Atlántico', 'Valle', 
           'Valle']),
np.array(['Cajica', 'Chía', 'Medellín', 'Envigado', 'Barranquilla', 'Soledad', 'Cali', 'Palmira'])] 

# www.dane.gov.co/index.php/estadisticas-por-tema/demografia-y-poblacion/proyecciones-de-poblacion
poblacion=pd.Series([92967, 149570, 2533424, 242197, 1274250, 665021, 2252616, 354285], index=arr_dptompio)
poblacion

Cundinamarca  Cajica            92967
              Chía             149570
Antioquia     Medellín        2533424
              Envigado         242197
Atlántico     Barranquilla    1274250
              Soledad          665021
Valle         Cali            2252616
              Palmira          354285
dtype: int64

In [95]:
poblacion.index.names

FrozenList([None, None])

In [96]:
poblacion.index.names=['dpto','mpio']
poblacion

dpto          mpio
Cundinamarca  Cajica            92967
              Chía             149570
Antioquia     Medellín        2533424
              Envigado         242197
Atlántico     Barranquilla    1274250
              Soledad          665021
Valle         Cali            2252616
              Palmira          354285
dtype: int64

In [67]:
nomdpto=['Cundinamarca', 'Cundinamarca', 'Antioquia', 'Antioquia', 'Atlántico', 'Atlántico', 'Valle', 
           'Valle']
nommpio= ['Cajica', 'Chía', 'Medellín', 'Envigado', 'Barranquilla', 'Soledad', 'Cali', 'Palmira']
tupla_nomdptompio = list(zip(dpto,mpio))
tupla_nomdptompio

[('Cundinamarca', 'Cajica'),
 ('Cundinamarca', 'Chía'),
 ('Antioquia', 'Medellín'),
 ('Antioquia', 'Envigado'),
 ('Atlántico', 'Barranquilla'),
 ('Atlántico', 'Soledad'),
 ('Valle', 'Cali'),
 ('Valle', 'Palmira')]

In [75]:
index = pd.MultiIndex.from_tuples(tupla_nomdptompio, names=['dpto', 'mpio'])
index

MultiIndex([('Cundinamarca',       'Cajica'),
            ('Cundinamarca',         'Chía'),
            (   'Antioquia',     'Medellín'),
            (   'Antioquia',     'Envigado'),
            (   'Atlántico', 'Barranquilla'),
            (   'Atlántico',      'Soledad'),
            (       'Valle',         'Cali'),
            (       'Valle',      'Palmira')],
           names=['dpto', 'mpio'])

In [76]:
# www.dane.gov.co/index.php/estadisticas-por-tema/demografia-y-poblacion/proyecciones-de-poblacion
poblacion=pd.Series([92967, 149570, 2533424, 242197, 1274250, 665021, 2252616, 354285], index=index)
poblacion

dpto          mpio
Cundinamarca  Cajica            92967
              Chía             149570
Antioquia     Medellín        2533424
              Envigado         242197
Atlántico     Barranquilla    1274250
              Soledad          665021
Valle         Cali            2252616
              Palmira          354285
dtype: int64

In [85]:
df_dptompio = pd.DataFrame(np.array([['Cundinamerca', 'Cajica'], ['Cundinamerca', 'Chía'],
                 ['Antioquia', 'Medellín'], ['Antioquia', 'Envigado'], 
                                    ['Atlántico','Barranquilla'], ['Atlántico','Soledad'], 
                                     ['Valle','Cali'],
                                    ['Valle','Palmira']]), columns=[['dpto', 'mpio']])
df_dptompio

           dpto          mpio
0  Cundinamerca        Cajica
1  Cundinamerca          Chía
2     Antioquia      Medellín
3     Antioquia      Envigado
4     Atlántico  Barranquilla
5     Atlántico       Soledad
6         Valle          Cali
7         Valle       Palmira

In [89]:
indice=pd.MultiIndex.from_frame(df_dptompio)
indice

MultiIndex([('Cundinamerca',       'Cajica'),
            ('Cundinamerca',         'Chía'),
            (   'Antioquia',     'Medellín'),
            (   'Antioquia',     'Envigado'),
            (   'Atlántico', 'Barranquilla'),
            (   'Atlántico',      'Soledad'),
            (       'Valle',         'Cali'),
            (       'Valle',      'Palmira')],
           names=[('dpto',), ('mpio',)])

In [90]:
poblacion=pd.Series([92967, 149570, 2533424, 242197, 1274250, 665021, 2252616, 354285], index=index)
poblacion

dpto          mpio
Cundinamarca  Cajica            92967
              Chía             149570
Antioquia     Medellín        2533424
              Envigado         242197
Atlántico     Barranquilla    1274250
              Soledad          665021
Valle         Cali            2252616
              Palmira          354285
dtype: int64

Los índices también pueden utilizarse en los pandas dataframes en las filas o en las columnas:

In [102]:
arr_dptompio = [np.array(['Cundinamarca', 'Cundinamarca', 'Antioquia', 'Antioquia', 'Atlántico', 'Atlántico', 'Valle', 
           'Valle']),
np.array(['Cajica', 'Chía', 'Medellín', 'Envigado', 'Barranquilla', 'Soledad', 'Cali', 'Palmira'])] 

datos= pd.DataFrame({'poblacion':[92967, 149570, 2533424, 242197, 1274250, 665021, 2252616, 354285],
                  'capital':[False,False,True,False,True,False,True,False]}, index=arr_dptompio)
datos

                           poblacion  capital
Cundinamarca Cajica            92967    False
             Chía             149570    False
Antioquia    Medellín        2533424     True
             Envigado         242197    False
Atlántico    Barranquilla    1274250     True
             Soledad          665021    False
Valle        Cali            2252616     True
             Palmira          354285    False

In [112]:
datos.loc[['Valle'],]

               poblacion  capital
Valle Cali       2252616     True
      Palmira     354285    False

In [114]:
datos.loc[[('Valle','Cali')],]

            poblacion  capital
Valle Cali    2252616     True

In [115]:
datos.loc[[('Valle','Cali'),('Cundinamarca','Cajica')],]

                     poblacion  capital
Valle        Cali      2252616     True
Cundinamarca Cajica      92967    False

In [129]:
#datos.loc[['Cali'],]
datos.xs('Cali', level=1, drop_level=False)
#datos.xs('Cali', level=1)

            poblacion  capital
Valle Cali    2252616     True

In [130]:
datos.loc[(slice(None), 'Cali'), :]

            poblacion  capital
Valle Cali    2252616     True

In [132]:
datos.loc[(pd.IndexSlice(None), pd.IndexSlice('Cali')), :]

TypeError: '_IndexSlice' object is not callable